CREATE DATABASE  IF NOT EXISTS `testnc`;
USE `testnc`;

DROP TABLE IF EXISTS `metro`;

CREATE TABLE `metro` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `lat` float(10,6) DEFAULT NULL,
  `lng` float(10,6) DEFAULT NULL,
  `color_line` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

INSERT INTO `metro` VALUES (1,'Девяткино',60.050182,30.443045,1),(2,'Гражданский проспект',60.034969,30.418224,1),(3,'Академическая',60.012806,30.396044,1),(4,'Политехническая',60.008942,30.370907,1),(5,'Площадь Мужества',59.999828,30.366159,1),(6,'Лесная',59.984947,30.344259,1),(7,'Выборгская',59.971649,30.348478,1),(8,'Площадь Ленина',59.957260,30.355383,1),(9,'Чернышевская',59.944530,30.359919,1),(10,'Площадь Восстания',59.930279,30.361069,1),(11,'Владимирская',59.927628,30.347898,1),(12,'Пушкинская',59.920650,30.329599,1),(13,'Технологический институт-1',59.916512,30.318485,1),(14,'Балтийская',59.907211,30.299578,1),(15,'Нарвская',59.901218,30.274908,1),(16,'Кировский завод',59.879688,30.261921,1),(17,'Автово',59.867325,30.261337,1),(18,'Ленинский проспект',59.851170,30.268274,1),(19,'Проспект Ветеранов',59.841835,30.251949,1),(20,'Парнас',60.066990,30.333839,2),(21,'Проспект Просвещения',60.051456,30.332544,2),(22,'Озерки',60.037098,30.321495,2),(23,'Удельная',60.016697,30.315607,2),(24,'Пионерская',60.002487,30.296759,2),(25,'Чёрная речка',59.985455,30.300833,2),(26,'Петроградская',59.966389,30.311293,2),(27,'Горьковская',59.956112,30.318890,2),(28,'Невский проспект',59.935051,30.329725,2),(29,'Сенная площадь',59.927135,30.320316,2),(30,'Технологический институт-2',59.916512,30.318485,2),(31,'Фрунзенская',59.906273,30.317450,2),(32,'Московские ворота',59.891788,30.317873,2),(33,'Электросила',59.879189,30.318659,2),(34,'Парк Победы',59.866344,30.321802,2),(35,'Московская',59.851341,30.321548,2),(36,'Звёздная',59.833241,30.349428,2),(37,'Купчино',59.829781,30.375702,2),(38,'Приморская',59.948521,30.234470,3),(39,'Василеостровская',59.942577,30.278254,3),(40,'Гостиный двор',59.933933,30.333410,3),(41,'Маяковская',59.931366,30.354645,3),(42,'Площадь Александра Невского-1',59.924370,30.385307,3),(43,'Елизаровская',59.896690,30.423656,3),(44,'Ломоносовская',59.877342,30.441715,3),(45,'Пролетарская',59.865215,30.470264,3),(46,'Обухово',59.848709,30.457743,3),(47,'Рыбацкое',59.830986,30.501259,3),(48,'Спасская',59.927135,30.320316,4),(49,'Достоевская',59.928234,30.346029,4),(50,'Лиговский проспект',59.920811,30.355055,4),(51,'Площадь Александра Невского-2',59.923550,30.383430,4),(52,'Новочеркасская',59.929092,30.411915,4),(53,'Ладожская',59.932430,30.439274,4),(54,'Проспект Большевиков',59.919838,30.466757,4),(55,'Улица Дыбенко',59.907417,30.483311,4),(56,'Комендантский проспект',60.008591,30.258663,5),(57,'Старая Деревня',59.989433,30.255163,5),(58,'Крестовский остров',59.971821,30.259436,5),(59,'Чкаловская',59.961033,30.292006,5),(60,'Спортивная',59.952026,30.291338,5),(61,'Адмиралтейская',59.936096,30.314747,5),(62,'Садовая',59.926739,30.317753,5),(63,'Звенигородская',59.920650,30.329599,5),(64,'Обводный канал',59.914684,30.348150,5),(66,'Волковская',59.896023,30.357540,5),(67,'Бухарестская',59.883610,30.369444,5),(68,'Международная',59.869999,30.379723,5);

DROP TABLE IF EXISTS `district`;

CREATE TABLE `district` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `safety` int(11) DEFAULT NULL,
  `life_quality` int(11) DEFAULT NULL,
  `transport_quality` int(11) DEFAULT NULL,
  `rest_availability` int(11) DEFAULT NULL,
  `parks_availability` int(11) DEFAULT NULL,
  `total` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

INSERT INTO `district` VALUES (1,'Центральный район',6,1,1,1,10,NULL),(2,'Московский район',5,2,4,8,3,NULL),(3,'Калининский район',11,3,2,15,4,NULL),(4,'Приморский район',7,4,8,5,2,NULL),(5,'Василеостровский район',3,5,3,6,14,NULL),(6,'Петроградский район',4,6,7,4,12,NULL),(7,'Красногвардейский район',13,7,9,14,11,NULL),(8,'Петродворцовый район',1,8,6,18,1,NULL),(9,'Фрунзенский район',14,9,11,10,7,NULL),(10,'Выборгский район',15,10,5,12,8,NULL),(11,'Невский район',18,11,13,16,13,NULL),(12,'Адмиралтейский район',17,12,10,3,18,NULL),(13,'Красносельский район',8,13,16,9,9,NULL),(14,'Кировский район',12,14,12,17,15,NULL),(15,'Кронштадский район',10,15,15,11,5,NULL),(16,'Курортный район',2,16,18,2,17,NULL),(17,'Пушкинский район',9,17,14,13,6,NULL),(18,'Колпинский район',16,18,17,7,16,NULL);

DROP TABLE IF EXISTS `company_type`;

CREATE TABLE `company_type` (
  `id_type` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` varchar(300) DEFAULT NULL,
  PRIMARY KEY (`id_type`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8;

INSERT INTO `company_type` VALUES (1,'Парк','Категория для пользователя'),(2,'Торговый центр','Категория для пользователя'),(3,'Школа','Категория для пользователя'),(4,'Спорт','Категория для пользователя'),(5,'Отдых/развлечение','Категория для пользователя'),(6,'Медицинское учреждение','Категория для пользователя'),(7,'Детский сад','Категория для пользователя'),(20,'Поликлиника','child for id = 5'),(21,'Травмотология','child for id = 5'),(22,'Родильный дом','child for id = 5'),(23,'Больница','child for id = 5'),(24,'Женская консультация','child for id = 5'),(25,'Детская поликлиника','child for id = 5'),(30,'Уличный тренажер','child for id = 3'),(31,'Бассейн','child for id = 3'),(32,'Стадион','child for id = 3'),(33,'Корт','child for id = 3'),(40,'Театр','child for id = 4'),(41,'Кинотеатр','child for id = 4'),(42,'Боулинг','child for id = 4'),(43,'Ресторан','child for id = 4');

DROP TABLE IF EXISTS `company`;

CREATE TABLE `company` (
  `id` bigint(40) NOT NULL AUTO_INCREMENT,
  `name` varchar(400) NOT NULL,
  `address` varchar(300) NOT NULL,
  `lng` double NOT NULL,
  `lat` double NOT NULL,
  `id_type` int(11) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `date` date NOT NULL,
  `url` varchar(255) DEFAULT NULL,
  `phone_number` varchar(150) DEFAULT NULL,
  `work_time` varchar(45) DEFAULT NULL,
  `additional_info` varchar(200) DEFAULT NULL,
  `id_from_source` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id_type_idx` (`id_type`),
  CONSTRAINT `id_type` FOREIGN KEY (`id_type`) REFERENCES `company_type` (`id_type`) ON DELETE NO ACTION ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

INSERT INTO `company` VALUES (1,'Детский сад № 5','Санкт-Петербург, ул. Гаванская, 56, литера Х',30.234669,59.940375,7,7,'2016-11-11','http://vasdou005.ucoz.ru','+7 (812) 352-55-82 ; ','пн-пт 7:00–19:00','',1007726729),(2,'Детский сад № 1','Санкт-Петербург, 12-я линия Васильевского острова, 25Ц',30.272605,59.939942,7,7,'2016-11-11','','+7 (812) 323-13-52 ; ','пн-пт 7:00–19:00','',1129104946),(3,'Детский сад № 28','Санкт-Петербург, ул. Наличная, 40, корп.3 литер А',30.229947,59.950391,7,7,'2016-11-11','http://vasdou028.ucoz.ru','+7 (812) 350-19-30 ; +7 (812) 350-24-54 ; +7 (812) 350-25-54 ; ','пн-пт 7:00–19:00','',1045750604),(4,'Детский сад № 16','Санкт-Петербург, ул. Беринга, 22, литера Б, корп.2',30.240733,59.941583,7,7,'2016-11-11','http://vasdou016.ucoz.ru','+7 (812) 352-63-23 ; +7 (812) 352-09-26 ; ','пн-пт 7:00–19:00','',1062581651),(5,'Детский сад № 35','Санкт-Петербург, линия 14-я В. О., 65а, литера A',30.266452,59.943377,7,7,'2016-11-11','','+7 (812) 327-78-62 ; +7 (812) 323-01-45 ; ','пн-пт 7:00–19:00','',1016677717),(6,'Детский Сад № 4','Санкт-Петербург, ул. Железноводская, 50, литер А',30.241362,59.949555,7,7,'2016-11-11','http://vasdou004.ucoz.ru','+7 (812) 350-26-66 ; +7 (812) 350-56-75 ; ','пн-пт 7:00–19:00','',1007061094),(7,'Детский сад № 8','Санкт-Петербург, Гаванская улица, 58',30.236466,59.941439,7,7,'2016-11-11','','+7 (812) 352-24-64 ; +7 (812) 352-24-68 ; +7 (812) 352-59-15 ; ','пн-пт 7:00–19:00','',1003340577),(8,'Британский детский сад','Санкт-Петербург, Тучков пер., 2',30.289754,59.943318,7,7,'2016-11-11','http://www.ila.spb.ru','+7 (812) 456-23-23 ; +7 (921) 937-56-51 ; +7 (812) 356-83-48 ; +7 (999) 026-02-27 ; ','пн-пт 9:00–18:00','',1046441970),(9,'Детский сад № 39','Санкт-Петербург, ул. Гаванская, 37',30.239134,59.935493,7,7,'2016-11-11','http://vasdou039.ucoz.ru','+7 (812) 356-94-88 ; ','пн-пт 7:00–19:00','',1060626224),(10,'Детский сад № 50','Санкт-Петербург, В.О., ул. Наличная, 21',30.235442,59.935277,7,7,'2016-11-11','http://vasdou050.ucoz.ru','+7 (812) 355-87-57 ; +7 (812) 355-45-23 ; ','пн-пт 7:00–19:00','',1116826177),(11,'Детский сад № 3','Санкт-Петербург, 7-я линия Васильевского острова, 20/2',30.283475,59.938495,7,7,'2016-11-11','','+7 (812) 323-68-28 ; ','пн-пт 7:00–19:00','',1086298018),(12,'Детский сад № 38','Санкт-Петербург, ул. Кораблестроителей, 35, корп.3, Литер А',30.223683,59.954606,7,7,'2016-11-11','http://www.gdoy38.ucoz.ru','+7 (812) 305-88-81 ; +7 (812) 351-21-10 ; +7 (812) 351-21-11 ; ','пн-пт 7:00–19:00','',1060528102),(13,'Детский сад № 10','Санкт-Петербург, Волховский переулок, 6Г',30.290904,59.944188,7,7,'2016-11-11','http://vasdou010.ucoz.ru','+7 (812) 328-39-19 ; ','пн-пт 7:00–19:00','',1069823845),(14,'Детский сад № 26','Санкт-Петербург, ул. Кораблестроителей, 37, корп.2, литера А',30.228031,59.95489,7,7,'2016-11-11','http://vasdou026.ucoz.ru','+7 (812) 498-89-52 ; +7 (812) 350-01-10 ; +7 (812) 350-28-58 ; ','пн-пт 7:00–19:00','',1091082376),(15,'Детский сад № 11','Санкт-Петербург, 12-я линия В. О., 21',30.273243,59.939356,7,7,'2016-11-11','http://vasdou011.ucoz.ru','+7 (812) 321-51-28 ; ','пн-пт 7:00–19:00','',1028630628),(16,'Детский сад № 33','Санкт-Петербург, ул. Кораблестроителей, 30, литер А, пом. 168Н',30.213509,59.95243,7,7,'2016-11-11','http://vasdou033.ucoz.ru','+7 (812) 305-63-61 ; +7 (812) 305-63-59 ; ','пн-пт 8:00–20:00','',1182015331),(17,'ГБДОУ Детский сад № 24 Василеостровского района','Санкт-Петербург, ул. Кораблестроителей, 29, корп.3',30.220431,59.951727,7,7,'2016-11-11','http://www.dou24.vospb.ru, vasdou024.ucoz.ru','+7 (812) 351-20-48 ; +7 (812) 352-57-48 ; ','пн-пт 7:00–19:00','',1070165448),(18,'Детский сад № 27','Санкт-Петербург, ул. Кораблестроителей, 29, корп.6',30.223557,59.95129,7,7,'2016-11-11','http://vasdou027.ucoz.ru','+7 (812) 350-10-77 ; +7 (812) 350-01-50 ; ','пн-пт 7:00–19:00','',1130571185),(19,'Детский сад № 44','Санкт-Петербург, ул. Наличная, 32, литера А, корп.3',30.224049,59.94532,7,7,'2016-11-11','http://dou44.ru','+7 (812) 355-06-55 ; +7 (812) 355-06-57 ; ','пн-пт 7:00–19:00','',1113292436),(20,'Детский сад № 20','Россия, Санкт-Петербург, Морская набережная, 35Ак3',30.219766,59.959278,7,7,'2016-11-11','http://vasdou020.ucoz.ru','+7 (812) 352-49-57 ; +7 (812) 352-81-97 ; +7 (812) 352-99-73 ; ','пн-пт 7:00–19:00','',1114282750),(21,'Детский сад № 19','Санкт-Петербург, улица Кораблестроителей, 19Л, литера ИТЕРА',30.216685,59.945031,7,7,'2016-11-11','http://vasdou019.ucoz.ru','+7 (812) 356-07-59 ; +7 (812) 356-16-16 ; ','пн-пт 7:00–19:00','',1118661124),(22,'ГБОУ Начальная школа-детский сад № 36 Василеостровского района Санкт-Петербурга','Санкт-Петербург, ул. Канареечная, 11, литер А',30.247578,59.931923,7,7,'2016-11-11','http://www.36spb.edusite.ru','+7 (812) 322-03-82 ; +7 (812) 322-36-91 ; +7 (906) 241-61-29 ; ','пн-пт 8:00–19:00','',1054772386),(23,'Детский сад № 14','Санкт-Петербург, улица Наличная, 40к6',30.226984,59.950764,7,7,'2016-11-11','http://vasdou014.ucoz.ru','+7 (812) 350-29-24 ; ','пн-пт 7:00–19:00','',1039041540),(24,'Детский сад № 29','Санкт-Петербург, ул. Кораблестроителей, 22, корп.3',30.209373,59.943922,7,7,'2016-11-11','http://www.vasdou029.ucoz.ru','+7 (812) 352-44-42 ; +7 (812) 352-22-02 ; ','пн-пт 7:00–19:00','',1105193644),(25,'Детский сад № 8','Санкт-Петербург, ул. Наличная, 22',30.232801,59.937707,7,7,'2016-11-11','http://vasdou002.ucoz.ru','+7 (812) 355-78-78 ; ','пн-пт 7:00–19:00','',1072606926),(26,'ГБДОУ Детский сад № 43','Санкт-Петербург, 20-я линия В. О., 19а',30.264161,59.935872,7,7,'2016-11-11','http://www.vasdou043.ucoz.ru','+7 (812) 321-47-52 ; ','пн-пт 7:00–19:00','',1087820172),(27,'Детский сад Инпредсервис','Санкт-Петербург, Мичманская улица, 2, корп. 2',30.208663,59.945112,7,7,'2016-11-11','http://www.inpredsad.ru','+7 (812) 305-79-92 ; ','пн-пт 9:00–19:00','',1480459671),(28,'Детский сад № 74 Пегасик','Санкт-Петербург, В.О., Малый просп., 6',30.278507,59.948005,7,7,'2016-11-11','http://www.пегасик74.рф','+7 (812) 323-74-83 ; ','пн-пт 7:00–19:00','',1042538701),(29,'Детский сад № 32','Санкт-Петербург, Морская наб., 43, литера А, корп.2',30.232619,59.958021,7,7,'2016-11-11','http://www.vasdou032.ucoz.ru','+7 (812) 352-89-50 ; +7 (812) 352-87-95 ; ','пн-пт 7:00–19:00','',1083491249),(30,'Детский сад № 51','Санкт-Петербург, ул. Кораблестроителей, 23, литера А, корп.3',30.217309,59.946291,7,7,'2016-11-11','http://vasdou051.ucoz.ru','+7 (812) 352-18-95 ; +7 (812) 352-13-83 ; ','пн-пт 7:00–19:00','',1102712631),(31,'Детский сад № 12','Санкт-Петербург, Детская улица, 15Б',30.249393,59.931675,7,7,'2016-11-11','http://vasdou012.ucoz.ru','+7 (812) 322-12-06 ; ','пн-пт 7:00–19:00','',1042423947),(32,'Детский сад № 36','Санкт-Петербург, 8-я линия В. О., 65',30.273261,59.945184,7,7,'2016-11-11','http://vasdou036.ucoz.ru','+7 (812) 323-06-00 ; ','пн-пт 7:00–19:00','',1092014559),(33,'Детский сад № 22','Санкт-Петербург, ул. Наличная, 36, литера А, корп.8',30.220629,59.946018,7,7,'2016-11-11','http://www.dou-22.com','+7 (812) 356-38-52 ; +7 (812) 356-83-49 ; ','пн-пт 7:00–19:00','',1098737291),(34,'Детский сад № 17','Санкт-Петербург, В.О., Малый просп., 15, литера В',30.274644,59.947712,7,7,'2016-11-11','http://vasdou017.ucoz.ru','+7 (812) 323-52-22 ; ','пн-пт 7:00–19:00','',1017798964),(35,'Детский сад № 29 комбинированного вида','Санкт-Петербург, Галерный пр-д, 5',30.22371,59.938784,7,7,'2016-11-11','','+7 (812) 355-97-49 ; +7 (812) 352-44-49 ; ','пн-пт 7:00–19:00','',1771996561),(36,'Детский сад № 73','Санкт-Петербург, ул. Карташихина, 7',30.242377,59.931346,7,7,'2016-11-11','http://vasdou073.ucoz.ru','+7 (812) 322-20-01 ; ','пн-пт 7:00–19:00','',1023126473),(37,'Гбдоу детский сад № 34 Василеостровского района Санкт-Петербурга','Россия, Санкт-Петербург, 23-я линия Васильевского острова, 22-24А',30.260253,59.934777,7,7,'2016-11-11','','+7 (812) 321-36-76 ; ','пн-пт 7:00–19:00','',1090024494),(38,'Детский сад № 53','Россия, Санкт-Петербург, улица Шевченко, 12А',30.245198,59.931341,7,7,'2016-11-11','http://vasdou053.ucoz.ru','+7 (812) 322-28-18 ; ','пн-пт 7:00–19:00','',1010280997),(39,'ГБДОУ Детский сад комбинированного вида № 37','Санкт-Петербург, Тучков пер., 17',30.287014,59.94641,7,7,'2016-11-11','','+7 (812) 323-21-39 ; ','пн-пт 7:00–19:00','',1332274957),(40,'ГБДОУ ЦРР Детский сад № 45','Санкт-Петербург, В.О., Большой просп., 48',30.270216,59.93488,7,7,'2016-11-11','http://www.gdou45.spb.ru','+7 (812) 321-37-75 ; ','пн-пт 7:00–19:00','',1270781961);

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


